isc-fs/stm32-can-bootloader/Core/Src/main.c
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief FDCAN2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_FDCAN2_Init(void)
{

  /* USER CODE BEGIN FDCAN2_Init 0 */

  /* USER CODE END FDCAN2_Init 0 */

  /* USER CODE BEGIN FDCAN2_Init 1 */

  /* USER CODE END FDCAN2_Init 1 */
  hfdcan2.Instance = FDCAN2;
  hfdcan2.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
  hfdcan2.Init.Mode = FDCAN_MODE_NORMAL;
  /* AutoRetransmission MUST be ENABLE for this bootloader. With it
   * DISABLE, FDCAN drops any frame that loses arbitration to a
   * higher-priority ID (the host sits on 0x001, the BL on 0x011 —
   * BL frames lose every arbitration during a host burst). Crucially
   * the FDCAN drop is *silent*: HAL_FDCAN_AddMessageToTxFifoQ already
   * returned HAL_OK (the frame entered the queue cleanly), so
   * send_raw has no signal that the on-wire transmission failed —
   * meanwhile bl_isotp_tx_next has already advanced tx->seq for the
   * lost frame. The visible symptom on the wire is CF emissions with
   * a 1 → 3 → 5 → 7 sequence (issue #94 Bug B).
   *
   * Worse, repeated TX failures eventually push the FDCAN node into
   * error-passive / bus-off — at which point the BL stops ACKing
   * incoming host frames, and the host's MAC retransmits its CFs
   * until it gives up. That's Bug A in the same issue: "BL silently
   * dropped a CF the host sent three times".
   *
   * Both bugs go away with AutoRetransmission ENABLE: FDCAN retries
   * a lost-arbitration frame until it wins the bus or hits a real
   * protocol error. Pre-cubeMX default left this DISABLE; the
   * bootloader's deployment context (multi-node CAN bus with always-
   * active peers) makes ENABLE the right setting. Audit pass:
   * confirmed no place in the project depends on "no retry"
   * behaviour. */
  hfdcan2.Init.AutoRetransmission = ENABLE;
  hfdcan2.Init.TransmitPause = DISABLE;
  hfdcan2.Init.ProtocolException = DISABLE;
  hfdcan2.Init.NominalPrescaler = 6;
  hfdcan2.Init.NominalSyncJumpWidth = 1;
  hfdcan2.Init.NominalTimeSeg1 = 2;
  hfdcan2.Init.NominalTimeSeg2 = 5;
  hfdcan2.Init.DataPrescaler = 1;
  hfdcan2.Init.DataSyncJumpWidth = 1;
  hfdcan2.Init.DataTimeSeg1 = 1;
  hfdcan2.Init.DataTimeSeg2 = 1;
  hfdcan2.Init.MessageRAMOffset = 0;
  hfdcan2.Init.StdFiltersNbr = 2;
  hfdcan2.Init.ExtFiltersNbr = 1;
  hfdcan2.Init.RxFifo0ElmtsNbr = 16;
  hfdcan2.Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_8;
  hfdcan2.Init.RxFifo1ElmtsNbr = 16;
  hfdcan2.Init.RxFifo1ElmtSize = FDCAN_DATA_BYTES_8;
  hfdcan2.Init.RxBuffersNbr = 0;
  hfdcan2.Init.RxBufferSize = FDCAN_DATA_BYTES_8;
  hfdcan2.Init.TxEventsNbr = 0;
  hfdcan2.Init.TxBuffersNbr = 0;
  hfdcan2.Init.TxFifoQueueElmtsNbr = 16;
  hfdcan2.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
  hfdcan2.Init.TxElmtSize = FDCAN_DATA_BYTES_8;
  if (HAL_FDCAN_Init(&hfdcan2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN FDCAN2_Init 2 */

  /* USER CODE END FDCAN2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, OK_STATUS_Pin|ERR_STATUS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : OK_STATUS_Pin ERR_STATUS_Pin */
  GPIO_InitStruct.Pin = OK_STATUS_Pin|ERR_STATUS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* ===================== BOOTLOADER CORE ========================= */

static void Bootloader_Init(void) {
	LED_OK_ON();
	LED_ERR_OFF();

	/* #125 H6: enable the DWT cycle counter, used by bl_flash_erase to
	 * time the erase. HAL_GetTick can't measure it — on the single-bank
	 * H733 the CPU stalls on instruction fetch for the whole erase, so
	 * SysTick interrupts starve and the tick barely advances. CYCCNT is
	 * clock-driven and counts through the stall. Set once, here. */
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0U;
	DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

	/* Latch the reset cause before anything else has a chance to clear
	 * RCC->RSR. Health reporting depends on this surviving the rest of
	 * the boot sequence. */
	bl_health_init();

	/* Bring up the DTC table in Backup SRAM. Runs after bl_health_init
	 * so bl_dtc_log can timestamp entries against uptime. Also validates
	 * the magic so a power-cycled BKPSRAM starts from a clean slate. */
	bl_dtc_init();

	/* Bring up the log ring in Backup SRAM (adjacent to the DTC table).
	 * Same persistence semantics — a host that reconnects after a crash
	 * can replay the last ~1 KB of bootloader log by issuing
	 * LOG_STREAM_START. */
	bl_log_init();
	bl_log_info("bootloader up (reset_cause=%u)",
	            (unsigned int)bl_health_reset_cause());

	/* #125 H6 (reset-on-spin): if the previous boot ended in a
	 * controlled reboot from a terminal fault (a CPU fault handler,
	 * Error_Handler, or a failed FDCAN init), bl_fault left a
	 * reset-surviving breadcrumb. Log it now — in this safe post-reset
	 * context, where bl_dtc_log's NOTIFY path is fine — so the cause is
	 * visible via `diagnose dtc` / health.last_dtc_code. One-shot:
	 * take_pending clears it. */
	uint8_t fault_reason = BL_FAULT_NONE;
	if (bl_fault_take_pending(&fault_reason)) {
		bl_dtc_log(BL_DTC_CPU_FAULT, BL_DTC_SEV_FATAL, (uint32_t)fault_reason);
		bl_log_error("recovered from fault reboot (reason=%u)",
		             (unsigned int)fault_reason);
	}

