isc-fs/stm32-can-bootloader/Core/Src/main.c
	/* Zero the live-data counters. The snapshot is pulled together on
	 * demand in bl_live_tick, so no persistent state needs initialising
	 * beyond this. */
	bl_live_init();

	/* Scan the NVM sector to find the append point and the current
	 * highest seq. Safe to call even when sector 7 is fully erased —
	 * in that case g_write_pos lands at 0 and future writes grow the
	 * log from scratch. */
	bl_nvm_init();

	/* Resolve the effective node ID now that NVM is queryable. Reads
	 * BL_NVM_KEY_NODE_ID if present, validates it, and caches the
	 * result for `bl_node_id_get()`. Must happen BEFORE the FDCAN
	 * filter config below — the filter is built from the resolved ID
	 * and is set up only once at boot. */
	bl_node_id_init_from_nvm();

	/* Boot-time WRP self-check. Production-provisioned units are
	 * expected to have sector 0 (the bootloader) WRP-protected; a
	 * missing latch is not fatal but it earns a WARN log line so the
	 * host's log stream flags it on connect. The WRP_PROTECTED flag in
	 * both health and live-data reflects this same check, so a host
	 * can gate OB_APPLY_WRP on the flag. */
	if (!bl_obyte_is_sector_wrp_protected(0U)) {
		bl_log_warn("WRP: bootloader sector 0 not write-protected; run OB_APPLY_WRP to latch");
	}

	/* Filters must be configured while the FDCAN is still in Init mode —
	 * i.e. before HAL_FDCAN_Start. */
	if (Bootloader_ConfigFdcanFilters() != HAL_OK) {
		/* #125 H6: a failed FDCAN bring-up used to spin here forever —
		 * the board went dead with no CAN, unflashable. Reboot instead;
		 * a transient init failure self-recovers, and the breadcrumb
		 * surfaces a BL_DTC_CPU_FAULT next boot. */
		LED_ERR_ON();
		bl_fault_reboot(BL_FAULT_FDCAN_INIT);
	}

	if (HAL_FDCAN_Start(&hfdcan2) != HAL_OK) {
		LED_ERR_ON();
		bl_fault_reboot(BL_FAULT_FDCAN_INIT);
	}

	/* NOTE on FDCAN interrupts: the main loop drains RX_FIFO0 by
	 * polling (HAL_FDCAN_GetRxFifoFillLevel + GetRxMessage below), so
	 * we deliberately do NOT activate FDCAN_IT_RX_FIFO0_NEW_MESSAGE.
	 *
	 * The previous code enabled the notification but never overrode
	 * HAL_FDCAN_RxFifo0Callback — so every RX frame entered the IRQ
	 * (FDCAN2_IT0_IRQHandler → HAL_FDCAN_IRQHandler) only to dispatch
	 * the default weak callback and return. Pure overhead, and a
	 * footgun for anyone who later added a real callback expecting
	 * it to actually drive RX while the main loop was still polling
	 * — concurrent drain of the same FIFO would have dropped frames.
	 * Audit follow-up (#68 last bullet). */

	/* Check if application explicitly requested to stay in bootloader */
	uint8_t bootReq = Bootloader_IsBootRequestActive();

	if (bootReq) {
		/* Stay in bootloader, do not arm auto-jump */
		g_AutoJumpEnabled = 0U;
	} else {
		/* Normal behavior: arm auto-jump if a valid application is present */
		uint8_t appStatus = Bootloader_CheckApplication();
		if (appStatus == 0x00U) {
			g_AutoJumpEnabled = 1U;
			g_AutoJumpDeadline = HAL_GetTick() + 2000U; /* e.g. 2 seconds window */
		} else {
			g_AutoJumpEnabled = 0U;
		}
	}
}

/* #125 C1: poll FDCAN protocol status and recover from Bus_Off.
 *
 * On Bus_Off the M_CAN sets CCCR.INIT and halts both TX and RX — the
 * BL stops ACKing and the host's session dies; the device is
 * unflashable over CAN until a power-cycle (and re-enters Bus_Off if
 * the fault persists). Recovery is a Stop→Start: HAL_FDCAN_Stop puts
 * the peripheral back to READY (INIT stays set), HAL_FDCAN_Start
 * clears INIT and arms the M_CAN's automatic recovery (it rejoins
 * after 128×11 consecutive recessive bits — ~2.8 ms of idle bus at
 * 500 kbps). The two RX filters live in message RAM, which Stop/Start
 * does NOT touch, so they survive — no need to reconfigure.
 *
 * Rate-limit: act on the transition INTO Bus_Off, then at most once
 * per BL_FDCAN_BUSOFF_RETRY_MS while it persists. Without this, calling
 * Stop/Start every loop iteration would continually restart the
 * recovery sequence and the node would never actually rejoin.
 *
 * GetProtocolStatus is a cheap PSR register read; safe to poll every
 * iteration. The Stop/Start only runs on an actual fault (rare).
 *
 * Observability (so the bench can confirm it fired): a per-boot
 * recovery counter in the health record (`fdcan_recovery_count`), a
 * BL_DTC_FDCAN_BUSOFF DTC carrying the attempt count, and a WARN log
 * line. */
#define BL_FDCAN_BUSOFF_RETRY_MS   100U

static void Bootloader_FdcanBusOffRecover(uint32_t now_ms) {
	static uint8_t  s_was_busoff      = 0U;
	static uint32_t s_last_attempt_ms = 0U;

	FDCAN_ProtocolStatusTypeDef ps = { 0 };
	if (HAL_FDCAN_GetProtocolStatus(&hfdcan2, &ps) != HAL_OK) {
		return;
	}

	if (ps.BusOff == 0U) {
		s_was_busoff = 0U;
		return;
	}

	/* Bus_Off is set. Act on the first detection, then rate-limited. */
	if (s_was_busoff != 0U &&
	    (now_ms - s_last_attempt_ms) < BL_FDCAN_BUSOFF_RETRY_MS) {
		return;
	}
	s_was_busoff      = 1U;
	s_last_attempt_ms = now_ms;

	/* Stop/Start to clear INIT and rejoin. Errors are non-fatal — we
	 * retry on the next poll; nothing else we can do but keep trying. */
	(void)HAL_FDCAN_Stop(&hfdcan2);
	(void)HAL_FDCAN_Start(&hfdcan2);

	bl_health_record_fdcan_recovery();
	bl_dtc_log(BL_DTC_FDCAN_BUSOFF, BL_DTC_SEV_WARN,
	           bl_health_fdcan_recovery_count());
	bl_log_warn("FDCAN bus-off — Stop/Start recovery #%u",
	            (unsigned int)bl_health_fdcan_recovery_count());
}

static void Bootloader_MainLoop(void) {
	FDCAN_RxHeaderTypeDef rxHeader;
	uint8_t rxData[8];

	while (1) {
		/* Drain any pending frames — each one cancels the auto-jump and
		 * is handed off to the protocol dispatcher. */
		if (HAL_FDCAN_GetRxFifoFillLevel(&hfdcan2, FDCAN_RX_FIFO0) > 0) {
			if (HAL_FDCAN_GetRxMessage(&hfdcan2,
			FDCAN_RX_FIFO0, &rxHeader, rxData) == HAL_OK) {

				/* The bootloader only speaks classic 11-bit IDs; any
				 * extended-ID frame is ignored entirely. */
				if (rxHeader.IdType == FDCAN_STANDARD_ID) {
					g_AutoJumpEnabled = 0U;

					bl_proto_id_t id;
					/* `bl_proto_parse_id` returns false on malformed
					 * IDs (bits 10..5 set, or reserved node→host node
					 * IDs). The FDCAN filter already rejects anything
					 * we can't decode, so in practice this guard is
					 * defence-in-depth against future filter drift
					 * or loopback-harness feeds. On false we skip the
					 * dispatch but still fall through to the tick
					 * block below, so session watchdogs keep running. */
					if (bl_proto_parse_id(rxHeader.Identifier, &id)) {
						/* `HAL_FDCAN_GetRxMessage` already extracts the DLC
						 * nibble into bits 3:0 of rxHeader.DataLength
						 * (see `FDCAN_ELEMENT_MASK_DLC >> 16U` in the
						 * STM32H7 HAL). For classic CAN the DLC value
						 * equals the byte count, so we just mask to the
						 * low nibble — NO extra shift. Earlier versions
						 * shifted >>16 again, which zeroed out every
						 * length and silently dropped every incoming
						 * frame at bl_proto_dispatch's `length == 0U`
						 * gate. */
						uint8_t length = (uint8_t)(rxHeader.DataLength & 0x0FU);
						if (length > 8U) {
							length = 8U;
						}

						bl_proto_dispatch(&id, rxData, length);
					}
				}
			}
		}

		/* Protocol tick — drives ISO-TP reassembly timeout. NACKs any
		 * peer whose multi-frame transfer stalled past BL_ISOTP_TIMEOUT_MS. */
		uint32_t tick_now = HAL_GetTick();
		bl_proto_tick(tick_now);
		bl_health_tick(tick_now);
		bl_log_tick(tick_now);
		bl_live_tick(tick_now);

		/* #125 C1: FDCAN bus-off auto-recovery. If a hard bus fault
		 * (sustained TX-arbitration loss, dominant-bit fault) drove
		 * the node into Bus_Off, the M_CAN sets CCCR.INIT and stops
		 * TX + RX — the BL would otherwise be permanently deaf until a
		 * power-cycle, i.e. unflashable over CAN. This rejoins the bus
		 * automatically. */
		Bootloader_FdcanBusOffRecover(tick_now);

