isc-fs/stm32-can-bootloader/Core/Src/main.c
		/* Auto-jump window: if we booted with a valid app and nobody
		 * has talked to us before the deadline, hand control over. */
		if (g_AutoJumpEnabled) {
			uint32_t now = HAL_GetTick();

			if ((int32_t)(now - g_AutoJumpDeadline) >= 0) {
				g_AutoJumpEnabled = 0U;

				if (Bootloader_CheckApplication() == 0x00) {
					Bootloader_JumpToApplication();
				} else {
					LED_ERR_ON();
				}
			}
		}

		/* NO HAL_Delay() here — the previous `HAL_Delay(1)` capped the
		 * main loop at 1 kHz, which made the BL drain FDCAN RX_FIFO0 at
		 * 1 kHz. At 500 kbps the host emits classic-CAN CFs at ~3 kHz
		 * (one frame every ~330 µs), so RX_FIFO0 (depth 16) overflowed
		 * mid-burst on every multi-frame WRITE_CHUNK. The
		 * reassembler then saw a sequence gap and NACKed with
		 * BL_NACK_TRANSPORT_ERROR — issue #94 Bug A (the bench-side
		 * symptom that the AutoRetransmission fix didn't address).
		 *
		 * Polling at MHz scale is fine here: the bootloader is wall-
		 * powered, has no power budget to defend, and the bl_*_tick
		 * functions above all enforce their own emission cadences
		 * internally so they don't get noisy under a fast loop. The
		 * audit-follow-up "drain in ISR" remains a future option but
		 * isn't needed once the artificial throttle is removed. */
	}
}

/* Configure FDCAN2 filters so FIFO0 only receives host→node frames
 * addressed to this board's resolved node ID (`bl_node_id_get()` —
 * NVM override if present, compile-time `BL_NODE_ID` otherwise) or
 * the broadcast address 0xF. Under the fix/12 wire format the 11-bit
 * ID layout is
 *
 *   bits 10..5 = 0   (reserved)
 *   bit  4     = 0   (host→node; node→host is 1 and must be rejected)
 *   bits 3..0  = destination node
 *
 * We use a mask filter that matches exactly five low bits
 * (`BL_PROTO_ID_VALID_MASK = 0x01F`), which pins bit 4 to 0 and the
 * low nibble to our node (or 0xF for broadcast). That rejects:
 *   - every node→host frame (bit 4 set)
 *   - frames addressed to a different node (low nibble mismatch)
 *   - malformed IDs with bits 5..10 set (unknown future extensions)
 *
 * Our own TX never loops back through this filter because it sits at
 * a different ID (direction bit 4 set), so the BL can't accidentally
 * receive its own replies. */
static HAL_StatusTypeDef Bootloader_ConfigFdcanFilters(void) {
	FDCAN_FilterTypeDef filter = { 0 };
	HAL_StatusTypeDef st;

	filter.IdType       = FDCAN_STANDARD_ID;
	filter.FilterType   = FDCAN_FILTER_MASK;
	filter.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
	filter.FilterID2    = BL_PROTO_ID_VALID_MASK;

	/* Unicast: host → this node. ID = BL_PROTO_DIR_HOST_TO_NODE | <id>
	 * where <id> is the resolved node ID (NVM override or compile-time
	 * default). Direction bit is 0; just the low nibble. */
	filter.FilterIndex = 0U;
	filter.FilterID1   = bl_node_id_get() & BL_PROTO_NODE_MASK;
	st = HAL_FDCAN_ConfigFilter(&hfdcan2, &filter);
	if (st != HAL_OK) {
		return st;
	}

	/* Broadcast: host → 0xF. */
	filter.FilterIndex = 1U;
	filter.FilterID1   = BL_PROTO_NODE_BROADCAST;
	st = HAL_FDCAN_ConfigFilter(&hfdcan2, &filter);
	if (st != HAL_OK) {
		return st;
	}

	/* Reject everything that doesn't match one of the two filters, and
	 * reject remote frames outright — the protocol has no use for them. */
	return HAL_FDCAN_ConfigGlobalFilter(&hfdcan2,
	                                    FDCAN_REJECT,
	                                    FDCAN_REJECT,
	                                    FDCAN_REJECT_REMOTE,
	                                    FDCAN_REJECT_REMOTE);
}

/* ===================== JUMP TO APPLICATION ====================== */

void Bootloader_JumpToApplication(void) {
	uint32_t appStack = *(__IO uint32_t*) BL_APP_BASE;       // 0x08020000
	uint32_t appEntry = *(__IO uint32_t*) (BL_APP_BASE + 4U); // 0x08020004
	pFunction JumpToApp = (pFunction) appEntry;

	/* --- Basic healthchecks --- */

	/* 1) Stack pointer in valid RAM (DTCM or RAM_D1) — same predicate
	 *    Bootloader_CheckApplication uses, so a metadata-approved app
	 *    can't be silently rejected here. See bl_app_validate.h. */
	if (!bl_app_stack_in_legal_range(appStack)) {
		LED_ERR_ON();
		return;
	}

	/* 2) Entry point inside app in FLASH */
	if (appEntry < BL_APP_BASE || appEntry > BL_APP_END) {
		LED_ERR_ON();
		return;
	}

	/* --- Disable peripherals and jump --- */

	HAL_FDCAN_DeInit(&hfdcan2);
	HAL_DeInit();

	/* Stop SysTick */
	SysTick->CTRL = 0;
	SysTick->LOAD = 0;
	SysTick->VAL = 0;

	__disable_irq();

	/* App vector table */
	SCB->VTOR = BL_APP_BASE;   // 0x08020000

	/* Make the VTOR write globally visible before anything that might
	 * read or be affected by it. On Cortex-M7 (vs M4 or M0) the CPU has
	 * a separate L1 I-cache and a speculative instruction prefetcher,
	 * plus a deeper pipeline; without an explicit data-synchronisation
	 * barrier here an instruction fetch that started before the VTOR
	 * change can still complete against the OLD vector table.
	 *
	 * The BL doesn't enable I/D-cache today, so the cache-coherency
	 * piece is latent — but ARM AN-298 (and the STM32H7 HAL examples)
	 * specify the DSB/ISB pair regardless of cache state, and we want
	 * this to be a no-op the day someone flips cache on to speed up
	 * CRC / VERIFY. Issue #67. */
	__DSB();

	/* Application stack */
	__set_MSP(appStack);

	/* Pipeline barrier so the MSP change is in effect before the next
	 * instruction starts executing. Without this the CPU is allowed
	 * to speculatively decode the upcoming `JumpToApp()` indirect
	 * branch with the OLD MSP in its rename state, which on a deep
	 * M7 pipeline could affect exception-frame placement if a fault
	 * triggered during the transition window. Issue #67. */
	__ISB();

	/* IRQs stay masked across the jump. The previous code re-enabled
	 * them here, which let any IRQ that was pending while masked (e.g.
	 * a queued SysTick — CTRL=0 above stops the counter but doesn't
	 * clear the pending flag) dispatch through the new VTOR before the
	 * application's Reset_Handler has run: the app's peripherals
	 * aren't initialised, its globals aren't relocated, stack-beyond-
	 * MSP isn't set up. Result: undefined behaviour at jump time,
	 * intermittent fault under bus load.
	 *
	 * The app's HAL_Init() / Reset_Handler will re-enable IRQs after
	 * it owns the CPU state. Matches the convention used by other
	 * production bootloaders (e.g. AM32-bootloader's blutil jump:
	 * disable once, never re-enable on the BL side). Issue #59. */

	/* Jump to app */
	JumpToApp();

