isc-fs/stm32-can-bootloader/Core/Src/main.c
	/* Just in case */
	while (1) {
	}
}
static uint32_t Bootloader_CalcCrc32(uint32_t address, uint32_t lengthBytes) {
	uint32_t crc = 0xFFFFFFFFU;
	uint8_t *ptr = (uint8_t*) address;

	for (uint32_t i = 0; i < lengthBytes; i++) {
		crc ^= ptr[i];
		for (uint32_t bit = 0; bit < 8; bit++) {
			if (crc & 1U) {
				crc = (crc >> 1) ^ 0xEDB88320U;  // polinomial CRC32-IEEE
			} else {
				crc >>= 1;
			}
		}
	}

	crc ^= 0xFFFFFFFFU;
	return crc;
}

uint8_t Bootloader_CheckApplication(void) {
	/* Read metadata from flash */
	uint32_t const *meta = (uint32_t const*) BL_APP_METADATA_ADDR;

	uint32_t magic = meta[0];
	uint32_t size = meta[1];
	uint32_t crc = meta[2];
	uint32_t appBase = meta[3];

	if (magic != BL_APP_META_MAGIC) {
		return 0x10;  // incorrect magic -> no valid firmware
	}

	if ((size == 0U) || (size > BL_APP_SIZE)) {
		return 0x11;  // invalid size
	}

	if ((crc == 0U) || (crc == 0xFFFFFFFFU)) {
		return 0x12;  // Invalid CRC
	}

	if (appBase != BL_APP_BASE) {
		return 0x13;  // metadata does not correspond to this configuration
	}
	/* Recalculate CRC on the Flash app to be sure */
	uint32_t crcCalc = Bootloader_CalcCrc32(BL_APP_BASE, size);
	if (crcCalc != crc) {
		return 0x14;  // Calculated CRC does not match stored CRC
	}

	/* Check vector table (stack pointer and entry) */
	uint32_t appStack = *(__IO uint32_t*) BL_APP_BASE;
	uint32_t appEntry = *(__IO uint32_t*) (BL_APP_BASE + 4U);

	/* Stack in DTCM or D1 RAM. Previously this used bitmask checks
	 * (& 0x2FF00000 == 0x24000000) that accepted the full 1 MB above
	 * 0x24000000 — much larger than the real 320 KB RAM_D1 — while
	 * Bootloader_JumpToApplication used a stricter range check. That
	 * divergence let a malformed app pass Check and then silently
	 * fail at Jump time with only an LED_ERR_ON. Both now share the
	 * same predicate (see bl_app_validate.h). Issue #66. */
	if (!bl_app_stack_in_legal_range(appStack)) {
		return 0x15;
	}

	/* entry must be within the app's range */
	if ((appEntry < BL_APP_BASE)
			|| (appEntry >= (BL_APP_BASE + BL_APP_SIZE))) {
		return 0x16;  // entry out of range
	}

	return 0x00;  //OK
}

static uint8_t Bootloader_IsBootRequestActive(void) {
	/* Enable backup domain access.
	 PWR clock is already enabled by SystemClock_Config(), so we do not call
	 __HAL_RCC_PWR_CLK_ENABLE() here. */
	HAL_PWR_EnableBkUpAccess();

	/* Make sure RTC clock is enabled so backup registers are accessible */
	if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0U) {
		__HAL_RCC_RTC_ENABLE();
	}

	uint32_t val = RTC->BKP0R;

	if (val == BL_BOOT_REQ_MAGIC) {
		/* Clear the flag so we do not stay in bootloader forever */
		RTC->BKP0R = 0U;
		return 1U;
	}

	return 0U;
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* #125 H6: HAL failures (mostly clock config in SystemClock_Config)
	 * used to spin here forever — a marginal HSE would leave the board
	 * dead before CAN even started. Reboot instead so a transient
	 * failure self-recovers; a hard failure loops slowly (bl_fault's
	 * dwell) and stays SWD-recoverable. */
	__disable_irq();
	bl_fault_reboot(BL_FAULT_ERROR_HANDLER);
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
